{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 1, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.009999999776482582}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 2250, 21], "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [225], "trainable": true, "name": "max_pooling1d_6", "pool_size": [225]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "batch_input_shape": [null, 10], "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}